**NAME: NERELLA VENKATA RADHAKRISHNA**

**ID: 190031187**

**SKILL-1**

In [1]:
import pandas as pd
import numpy as np

In [2]:
#1. Use series method to convert the following list [‘a’,’b’,’c’,’d’]

list=['a','b','c','d']
series=pd.Series(list)
print(series)

0    a
1    b
2    c
3    d
dtype: object

In [3]:
d=['radha','krishna','kowshik','sudheer','chandu','ashok']
m=[[67,89,68,95], [87,94,97,76], [77,85,99,74], [90,89,92,78], [83,97,80,98],[90,90,80,87]]
s=['DS','AI','MPII','CNS']

In [14]:
#2. Create data frames which club them all using pandas
df=pd.DataFrame(data=m,index=d,columns=s)
df

         DS  AI  MPII  CNS
radha    67  89    68   95
krishna  87  94    97   76
kowshik  77  85    99   74
sudheer  90  89    92   78
chandu   83  97    80   98
ashok    90  90    80   87

In [15]:
#3. Add the TS , total columns to the data frame from which TS is the sum of  DS,AI,MPII and total is the sum of all subjects 
df['TS']=df['DS']+df['AI']+df['MPII']
df['TOTAL']=df['DS']+df['AI']+df['MPII']+df['CNS']+df['TS']
df

         DS  AI  MPII  CNS   TS  TOTAL
radha    67  89    68   95  224    543
krishna  87  94    97   76  278    632
kowshik  77  85    99   74  261    596
sudheer  90  89    92   78  271    620
chandu   83  97    80   98  260    618
ashok    90  90    80   87  260    607

In [8]:
#4. Display only the marks scored by Name 2 and Name3
df.loc[['krishna','kowshik']]

         DS  AI  MPII  CNS   TS  TOTAL
krishna  87  94    97   76  278    632
kowshik  77  85    99   74  261    596

In [9]:
#5. Display all the students marks who scored 90 + marks in DS
df[df['DS']>90]

Empty DataFrame
Columns: [DS, AI, MPII, CNS, TS, TOTAL]
Index: []

In [10]:
#6. DS teacher wants to know the total marks achieved by students in DS , Help her by using the sum method in data frame
sum(df['DS'])

494

In [16]:
#B)	Include .csv file in python
dataset=pd.read_csv('MOTORS.csv')
dataset

,flow rate(lit/min;/ /,speed,capacity,voltage,current,temprature,capacity in watt,performance
0,40,1400,0.5,120,3.104167,10,372.5,0
1,80,2800,1.0,240,3.104167,20,745.0,0
2,40,1400,0.5,120,3.104167,10,372.5,0
3,160,5600,2.0,480,3.104167,40,1490.0,1
4,40,1400,0.5,120,3.104167,10,372.5,0
...,...,...,...,...,...,...,...,...
194,80,2800,1.0,240,3.104167,20,745.0,0
195,40,1400,0.5,120,3.104167,10,372.5,0
196,80,2800,1.0,240,3.104167,20,745.0,0
197,160,5600,2.0,480,3.104167,40,1490.0,1
198,80,2800,1.0,240,3.104167,20,745.0,0